export const compositeIndicatorMock = {
    name: '路网运行综合指标监控',
    data: [20, 350, 300, 300, 200, 400, 350, 400, 300],
};

export const trafficData = [
    {
        name: '北京方向',
        data: [20, 350, 300, 300, 200, 400, 350, 400, 300],
    },
    {
        name: '雄安方向',
        data: [400, 450, 500, 400, 350, 400, 400, 500, 500],
    },
];

export const serviceFlowData  = [
    {
        name: '北京方向',
        data: [20, 350, 300, 300, 200, 400, 350, 400, 300],
    },
    {
        name: '雄安方向',
        data: [400, 450, 500, 400, 350, 400, 400, 500, 500],
    },
    {
        name: '其他',
        data: [200, 300, 350, 300, 400, 230, 340, 100, 300],
    },
];
