export const breadList = [
    {
        key: 'main-1',
        name: '数据挖掘分析',
        href: '/dataanalysis/home',
    },
    {
        key: 'main-2',
        name: '路网专题',
        href: '/dataanalysis/roadNetwork',
    },
];

export const ROAD_SECTION = new Map([
    [-1, '容城东-雄安'],
    [1, '雄安-容城东'],
    [2, '雄安-泗庄'],
    [3, '泗庄-雄安'],
    [4, '泗庄-高碑店东'],
    [5, '高碑店东-泗庄'],
    [6, '高碑店东-东湾枢纽'],
    [7, '涿州东-固安西'],
    [8, '涿州东-义和庄枢纽'],
    [9, '义和庄枢纽-涿州东'],
    [10, '北京界-义和庄枢纽'],
    [11, '东湾枢纽-高碑店东'],
    [12, '东湾枢纽-固安西'],
    [13, '固安西-东湾枢纽'],
    [14, '固安西-涿州东'],
]);


// 事件类型
export const EVENT_TYPE = new Map([
    [0, '异常停车'],
    [1, '行人闯入'],
    [2, '交通拥堵'],
    [3, '交通阻塞'],
    [4, '车辆逆行'],
    [5, '道路遗撒'],
    [6, '机动车驶离'],
    [7, '非机动车闯入'],
    [8, '异常摩托车'],
    [9, '交通事故'],
    [10, '火灾烟雾'],
    [11, '异常低速'],
    [12, '占用应急车道'],
    [13, '车辆倒车'],
    [14, '道路积雪'],
    [15, '团雾'],
    [20, '压线行驶'],
    [21, '施工区域'],
    [22, '恶劣气象'],
    [99, '其他'],
]);

export const DIRECTION = new Map([
    [-1, '全部'],
    [1, '雄安-北京'],
    [2, '北京-雄安'],
]);

export const SPACE_TYPE = new Map([
    [-1, '宏观'],
    [1, '中观'],
    [2, '微观'],
]);

export const TIME_TYPE = new Map([
    [-1, '月'],
    [1, '日'],
    [2, '时'],
]);

export const TIME_RANGE = new Map([
    [1, '01:00-02:00'],
    [2, '02:00-03:00'],
    [3, '03:00-04:00'],
    [4, '04:00-05:00'],
    [5, '05:00-06:00'],
    [6, '06:00-07:00'],
    [7, '07:00-08:00'],
    [8, '08:00-09:00'],
    [9, '09:00-10:00'],
    [10, '10:00-11:00'],
    [11, '11:00-12:00'],
    [12, '12:00-13:00'],
    [13, '13:00-14:00'],
    [14, '14:00-15:00'],
    [15, '15:00-16:00'],
    [16, '16:00-17:00'],
    [17, '17:00-18:00'],
    [18, '18:00-19:00'],
    [19, '19:00-20:00'],
    [20, '20:00-21:00'],
    [21, '21:00-22:00'],
    [22, '22:00-23:00'],
    [23, '23:00-00:00'],
    [0, '00:00-01:00'],
]);
export const TIME1_TYPE = new Map([
    [-1, '月'],
    [1, '日'],
]);

export const VISIBLE_DEFAULT = {
    addCard: false,
    chooseSet: false,
};