export const DEVICE_STATUS = {
    '1': '运行中',
    '2': '故障中',
    // '3': '维修中',
    // '4': '已停用',
    // '5': '已移除',
    // '6': '其他'
    // '1': '正常运行中',
    // '2': '故障中',
    // '3': '维修中',
    // '4': '已停用',
    // '5': '已移除',
    // '6': '其他'
};

export const SYSTEM_TYPE = {
    '1': '监控',
    '2': '收费',
    '3': '通信',
    '4': '照明',
};

export const DEVICE_BRAND = {
    '1': '大华',
    '2': '宇视',
    '3': '海康',
};

export const DEVICE_LOCATION = {
    '1': '北京-雄安',
    '2': '雄安-北京',
};

export const DEVICE_FAULT = {
    '1': '路网',
    '2': '协同办公',
    '3': '检修',
};

export const DEVICE_DEVICE = {
    '1': '云台摄像机',
    '2': '全景摄像机',
    '3': '车载移动视频',
    '4': 'AI摄像机',
    '5': '抓拍卡口',
    '6': '智慧服务区卡口',
    '7': '智慧车道屏',
    '8': '悬臂式大屏',
    '9': '气象检测器',
    '10': '能见度检测器',
    '11': '智慧机箱',
    '12': '防雷',
    '13': '智慧服务区显示屏',
    '14': '车检器',
    '15': '门架式大屏',
    '16': '智慧井盖',
    '17': '收费广场摄像机',
    '18': '收费车道摄像机',
    '19': '照明',
    '20': '服务器',
    '21': '车道指示器',
    '99': '其他',
    '100': '100龙门架',
    '101': '服务区',
    '102': '治超广场',
    '103': '服务区',
    '104': '枢纽立交',
    '105': '养护工区',
    '106': '收费站情报板',
    '107': '灯杆屏',
    '108': '服务区',
    '109': '机箱抓拍',
    '110': '箱变',
    '111': '防火墙',
    '112': '交换机',
    '113': '服务器',
    '114': '路由器',
    '115': '网关',
    '116': '车道控制器',
    '117': '安全接设备',
    '118': 'RSU控制器',
    '119': '磁盘阵列',
    '120': '车辆识别设备',
    '121': '入侵检测系统',
    '122': '网络审计系统',
    '123': '车道控制器',
    '124': '入口称重检测车道车道控制器',
    '125': '称重检测显示屏',
    '126': 'ETC车道手持机',
    '127': '高音喇叭',
    '128': '视频存储阵列',
    '129': '机房摄像机',
    '130': '户外摄像机',
    '131': '串口服务器',
    '132': '集中控制器',
    '133': '工作站',
    '134': '供配电',
};
